"""
会話パート: 牢獄で少女と出会うシーン
"""
label d01:
    # TODO: 右側から少女が入ってくる演出を入れたい
    scene bg rougoku
    with fade

    show girl

    g "この場所が読み込まれるなんて、ずいぶん久しぶりだね"

    g "君は......どうやら私の知り合いではないみたい"

    g "何もないところだけどゆっくりしていきなよ"

    "......"

    show girl surprise 

    g "......え？どうしていきなり牢屋の中に閉じ込めたのか......って？"

    show girl look away

    g "ああ......それはね......えーっと......"

    show girl smile

    g "......ほら、気が付いたらいきなり牢屋の中なんて、ゲームにはお決まりの展開なんだから、あまり追求しないでおこうよ"

    g "よくあるでしょう？そういう設定も理由もない、脱出ゲームってやつ？"

    "......"

    g "......それに、こういう種類のゲームをするために、君はここに来たんじゃないの？"

    "......"

    show girl

    g "......とにかく、ゲームに脈絡を求めるなんて野暮だよ"

    show girl smile

    g "ゲームは、プレイヤーを驚かせてこそ......だからさ"

    "......"

    show girl look away

    g "......というわけで、脈絡なくこのゲームの目標を君に教えるね"

    show girl

    g "このゲームの目標......それは、私をゴールまで導くこと"

    g "......何言ってるかわからない？"

    g "そうかも、でもそんなものだよ"

    show girl smile

    g "ゲームは、手探りで進んでこそ......だからね"

    show girl

    g "とにかく君は、私の促すままに進んでいけばいいから"

    "......"

    g "......まずは、その牢屋から出ないとね"

    g "鍵があるはずだけど、見つかるかな"

    hide girl

    jump e02 