"""
会話パート: 最初に少女と出会うシーン
"""
label d01:
    # TODO: 右側から少女が入ってくる演出を入れたい
    scene bg rougoku
    with fade

    show girl

    g "この場所が読み込まれるなんて、ずいぶん久しぶりだね"

    g "君は......どうやら私の知り合いではないみたい"

    g "君が誰なのかはよくわからないけど、人と話せてうれしい"

    "......"

    show girl look away

    g "......ところでさ、どうして君がこのプログラムを起動したのか私にはわからないんだけど......"

    show girl
    
    g "ゲームを遊びに来た......ってことでいいんだよね？"

    "......"

    show girl smile

    g "なんにせよ、私との遊びに付き合ってほしいんだけど、どうかな？"

    show girl look away

    g "とにかく暇なんだよ......私ここにずっと一人だからさ......"

    show girl

    g "このゲームは、脱出ゲームだよ"

    g "特に理由もなく狭い部屋に閉じ込められて、どういう仕組みなのかよくわからない珍妙な機械にパスワードを入力して......"

    g "とにかくそこから出ることだけを目指して進んでいく、あの、脱出ゲーム"

    show girl look away

    g "とはいえ、実はこのゲーム、一部完成してないんだよね"

    g "だから、うまく動かないことがあるかもしれない......"

    show girl smile

    g "そんな状態のゲームをプレイさせるなって？"

    show girl look away

    g "ほら、ゲーム開発ってうまく進まないものだし、多少のほころびは許してやってよ"

    g "......彼、このゲームの開発頑張ってたし......"

    show girl

    g "それに、私も暇で暇で仕方ないんだよ"

    show girl smile

    g "君もこんな時間からこんなゲーム起動して、時間持て余してたんでしょ？"

    show girl

    g "ま、私にはいま君がどういう状況でこのゲームをプレイしてるのか、さっぱりわかんないけど"

    show girl smile

    g "とにかく進めるところまで進もう！そこが、このゲームのゴールってことにしてさ"

    show girl

    g "......まずは、この部屋から脱出しないとね"

    g "この部屋の探索から始めてみたら？"

    hide girl

    jump e01 